app/views/jobs/_form.html.erb

    <label>Freelancer</label>
    <%= f.select :user_id, User.all.map { |user| [ user.name, user.id ] }, :include_blank => true, :class=> "form-control" %>
---
SELECT "users".* FROM "users"

    <label>Project</label>
    <%= f.select :project_id, Project.all.map { |project| [ project.name, project.id ] }, :include_blank => true, :class=> "form-control" %>
---
SELECT "projects".* FROM "projects"