app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "active", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Project 2"], ["description", "building some stuff"], ["active", "t"], ["job_id", 5], ["created_at", "2015-10-29 06:46:15.544578"], ["updated_at", "2015-10-29 06:46:15.544578"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save