app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "collaborator", "skillset", "hiring_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["collaborator", "f"], ["skillset", ""], ["hiring_status", "f"], ["created_at", "2015-10-29 03:50:25.216239"], ["updated_at", "2015-10-29 03:50:25.216239"]]